<?php

namespace Database\Seeders;

use App\Models\Department;
use App\Models\Gd;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class DepartmentSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        //
        $gds = [
            [
                "name" => "អគ្គលេខាធិការដ្ឋាន",
                "order" => 1,
                "departments" => [
                    [
                        "name" => "នាយកដ្ឋានរដ្ឋាបាល",
                        "order" => 1
                    ],
                    [
                        "name" => "នាយកដ្ឋានធនធានមនុស្ស",
                        "order" => 2
                    ],
                    [
                        "name" => "នាយកដ្ឋានហិរញ្ញវត្ថុ",
                        "order" => 3
                    ],
                    [
                        "name" => "នាយកដ្ឋានផែនការនិងស្ថិតិ",
                        "order" => 4
                    ],
                    [
                        "name" => "នាយកដ្ឋាននីតិកម្ម",
                        "order" => 5
                    ],
                    [
                        "name" => "នាយកដ្ឋានសហប្រតិបត្តិការអន្តរជាតិ",
                        "order" => 6
                    ],
                    [
                        "name" => "នាយកដ្ឋានបរិវត្តកម្មឌីជីថល",
                        "order" => 7
                    ],
                    [
                        "name" => "នាយកដ្ឋានផ្សព្វផ្សាយកសិកម្ម",
                        "order" => 8
                    ],
                    [
                        "name" => "នាយកដ្ឋានអភិវឌ្ឍន៍សហគមន៍កសិកម្ម",
                        "order" => 9
                    ],
                    [
                        "name" => "នាយកដ្ឋានកសិឧស្សាហកម្ម",
                        "order" => 10
                    ],
                    [
                        "name" => "នាយកដ្ឋានគ្រប់គ្រងសាយតេសកម្ពុជា",
                        "order" => 10
                    ],
                    [
                        "name" => "អង្គភាពថវិកានៃអគ្គលេខាធិការដ្ឋាន",
                        "order" => 11
                    ],
                ]
            ],
            [
                "name" => "អគ្គនាយកដ្ឋានក្សេត្រសាស្ត្រ",
                "order" => 2,
                "departments" => [
                    [
                        "name" => "នាយកដ្ឋានអភិវឌ្ឍន៍ដំណាំស្រូវ",
                        "order" => 1
                    ],
                    [
                        "name" => "នាយកដ្ឋានអភិវឌ្ឍន៍ដំណាំរដូវ",
                        "order" => 2
                    ],
                    [
                        "name" => "នាយកដ្ឋានអភិវឌ្ឍន៍ដំណាំរយៈពេលវែង",
                        "order" => 3
                    ],
                    [
                        "name" => "នាយកដ្ឋានអភិវឌ្ឍន៍ដំណាំកៅស៊ូ",
                        "order" => 4
                    ],
                    [
                        "name" => "នាយកដ្ឋានការពារដំណាំ អនាម័យ និងភូតគាមអនាម័យ",
                        "order" => 5
                    ],
                    [
                        "name" => "នាយកដ្ឋានគ្រប់គ្រងធនធានដីនិងជីកសិកម្ម",
                        "order" => 6
                    ],
                    [
                        "name" => "នាយកដ្ឋានគ្រប់គ្រងពូជដំណាំ",
                        "order" => 7
                    ],
                    [
                        "name" => "លេខាធិការដ្ឋាន",
                        "order" => 8
                    ],

                ]
            ],
            [
                "name" => "អគ្គនាយកដ្ឋានសុខភាពសត្វ និងផលិតកម្មសត្វ",
                "order" => 3,
                "departments" => [
                    [
                        "name" => "នាយកដ្ឋានអភិវឌ្ឍន៍អាជីវកម្មសត្វ និងផលិតកម្មសត្វ",
                        "order" => 1
                    ],
                    [
                        "name" => "នាយកដ្ឋានគ្រប់គ្រងសុខភាពសត្វ និងសុខភាពសាធារណៈបសុព្យាបាល",
                        "order" => 2
                    ],
                    [
                        "name" => "នាយកដ្ឋានអធីការកិច្ចសុខភាពសត្វ និងផលិតកម្មសត្វ",
                        "order" => 3
                    ],
                    [
                        "name" => "លេខាធិការដ្ឋាន",
                        "order" => 4
                    ],
                ]
            ],
            [
                "name" => "អគ្គនាយកដ្ឋានជលផល",
                "order" => 4,
                "departments" => [
                    [
                        "name" => "នាយកដ្ឋានអភិវឌ្ឍន៍វារីវប្បកម្ម",
                        "order" => 1
                    ],
                    [
                        "name" => "នាយកដ្ឋានគ្រប់គ្រងអាជីវកម្មជលផល",
                        "order" => 2
                    ],
                    [
                        "name" => "នាយកដ្ឋានគ្រប់គ្រងវារីជាតិ",
                        "order" => 3
                    ],
                    [
                        "name" => "នាយកដ្ឋានអភិវក្សជលផល",
                        "order" => 4
                    ],
                    [
                        "name" => "នាយកដ្ឋានអធិការកិច្ចជលផល",
                        "order" => 5
                    ],
                    [
                        "name" => "លេខាធិការដ្ឋាន",
                        "order" => 6
                    ],
                ]
            ],
            [
                "name" => "អគ្គនាយកដ្ឋានព្រៃឈើ និងសត្វព្រៃ",
                "order" => 5,
                "departments" => [
                    [
                        "name" => "នាយកដ្ឋានគ្រប់គ្រងព្រៃផ្តល់ផលធម្មជាតិ",
                        "order" => 1
                    ],
                    [
                        "name" => "នាយកដ្ឋានគ្រប់គ្រងអាជីវកម្មព្រៃដាំ និងចម្ការឈើឯកជន",
                        "order" => 2
                    ],
                    [
                        "name" => "នាយកដ្ឋានគ្រប់គ្រងកែច្នៃឈើ និងអាជីវកម្មឈើ",
                        "order" => 3
                    ],
                    [
                        "name" => "នាយកដ្ឋានគ្រប់គ្រងសត្វព្រៃ និងជីវៈចម្រុះ",
                        "order" => 4
                    ],
                    [
                        "name" => "នាយកដ្ឋានអធិការកិច្ចព្រៃឈើ និងសត្វព្រៃ",
                        "order" => 5
                    ],
                    [
                        "name" => "នាយកដ្ឋានគ្រប់គ្រងសួនសត្វ",
                        "order" => 6
                    ],
                    [
                        "name" => "លេខាធិការដ្ឋាន",
                        "order" => 7
                    ]
                ]
            ],
            [
                "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទរាជធានី ខេត្ត",
                "order" => 6,
                "departments" => [
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តបន្ទាយមានជ័យ",
                        "order" => 1
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តបាត់ដំបង",
                        "order" => 2
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តកំពង់ចាម",
                        "order" => 3
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តកំពង់ឆ្នាំង",
                        "order" => 4
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តកំពង់ស្ពឺ",
                        "order" => 5
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តកំពង់ធំ",
                        "order" => 6
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តកំពត",
                        "order" => 7
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តកណ្តាល",
                        "order" => 8
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តកោះកុង",
                        "order" => 9
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តក្រចេះ",
                        "order" => 10
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តមណ្ឌលគិរី",
                        "order" => 11
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ រាជធានីភ្នំពេញ",
                        "order" => 12
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តព្រះវិហារ",
                        "order" => 13
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តព្រៃវែង",
                        "order" => 14
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តពោធិ៍សាត់",
                        "order" => 15
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តរតនគិរី",
                        "order" => 16
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តសៀមរាប",
                        "order" => 17
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តព្រះសីហនុ",
                        "order" => 18
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តស្ទឹងត្រែង",
                        "order" => 19
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តស្វាយរៀង",
                        "order" => 20
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តតាកែវ",
                        "order" => 21
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តឧត្តរមានជ័យ",
                        "order" => 22
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តកែប",
                        "order" => 23
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តប៉ៃលិន",
                        "order" => 24
                    ],
                    [
                        "name" => "មន្ទីរកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ ខេត្តត្បូងឃ្មុំ",
                        "order" => 25
                    ],
                ]
            ],
            [
                "name" => "គ្រឹះស្ថានសាធារណៈរដ្ឋបាល",
                "order" => 7,
                "departments" => []
            ],
            [
                "name" => "អគ្គនាយកដ្ឋានសវនកម្មផ្ទៃក្នុង",
                "order" => 8,
                "departments" => []
            ],
            [
                "name" => "អង្គភាពទទួលបន្ទុកហិរញ្ញវត្ថុនៃអគ្គលេខាធិការដ្ឋាន",
                "order" => 9,
                "departments" => [
                    [
                        "name" => "នាយកដ្ឋានហិរញវត្ថុ",
                        "order" => 1
                    ],
                    [
                        "name" => "នាយកដ្ឋានផែនការ និងស្ថិតិ",
                        "order" => 2
                    ],
                    [
                        "name" => "អង្គភាពលទ្ធកម្ម",
                        "order" => 3
                    ],
                ]
            ]
        ];
        foreach ($gds as $gd) {
            $g = Gd::create([
                'name' => $gd['name'],
                'order' => $gd['order']
            ]);
            foreach ($gd['departments'] as $department) {
                Department::create([
                    'gd_id' => $g->id,
                    'name' => $department['name'],
                    'order' => $department['order']
                ]);
            }
        };
    }
}
