<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class PersonelSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        //
        $personels = [
            [
                "name" => "ឯកឧត្តម ឌិត ទីណា",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position" => "រដ្ឋមន្ត្រី",
                "order" => 1
            ],
            [
                "name" => "ឯកឧត្តម អ៊ឹម ស៊ីថុល",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position" => "រដ្ឋលេខាធិការ",
                "order" => 2
            ],
            [
                "name" => "ឯកឧត្តម នុង ច័ន្ទសុខា",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position" => "រដ្ឋលេខាធិការ",
                "order" => 3
            ],
            [
                "name" => "ឯកឧត្តម យុទ្ធ ភូថង",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position" => "រដ្ឋលេខាធិការ",
                "order" => 4
            ],
             [
                "name"=>"ឯកឧត្តម ឳម គឺមស៊ា",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>5
            ],
             [
                "name"=>"លោកជំទាវ ហោ ម៉ាលីន",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>6
            ],
             [
                "name"=>"ឯកឧត្តម លី ផល្លា",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>7
            ],
             [
                "name"=>"ឯកឧត្តម ហាស់ សារ៉េត",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>8
            ],
             [
                "name"=>"ឯកឧត្តម ហ៊ាន វណ្ណហន",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>9
            ],
             [
                "name"=>"ឯកឧត្តម អ៊ុង សំអាត",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>10
            ],
             [
                "name"=>"ឯកឧត្តម សេន សុវណ្ណ",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>11
            ],
             [
                "name"=>"ឯកឧត្តម ម៉ាន សុគ្រី",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>12
            ],
             [
                "name"=>"ឯកឧត្តម ចាន់ សុវុឌ្ឍ",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>13
            ],
             [
                "name"=>"ឯកឧត្តម គឹម សុន",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>14
            ],
             [
                "name"=>"ឯកឧត្តម តូច ប៊ុនហួរ",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>15
            ],
             [
                "name"=>"ឯកឧត្តម ហ៊ួត ប៊ុតណារី",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>16
            ],
             [
                "name"=>"ឯកឧត្តម ចាន់ ចេស្តា",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>17
            ],
             [
                "name"=>"ឯកឧត្តម គង់ ច័ន្ទវាសនា",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>18
            ],
             [
                "name"=>"ឯកឧត្តម យ៉ង សាំង កុមារ",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>19
            ],
             [
                "name"=>"ឯកឧត្តម រស់ សូដែន",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>20
            ],
             [
                "name"=>"ឯកឧត្តម ឃុន សាវឿន",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>21
            ],
             [
                "name"=>"ឯកឧត្តម ប្រាក់ ដាវីដ",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>22
            ],
             [
                "name"=>"ឯកឧត្តម អ៊ួង កុសល",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>23
            ],
             [
                "name"=>"ឯកឧត្តម មាស ពិសិដ្ឋ",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>24
            ],
             [
                "name"=>"ឯកឧត្តម កែវ អូម៉ាលីស្ស",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"រដ្ឋលេខាធិការ",
                "order"=>25
            ],
             [
                "name"=>"ឯកឧត្តម អ៊ឹង ហុកលីម",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>26
            ],
            [
                "name"=>"ឯកឧត្តម គិត សេង",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>27
            ],
            [
                "name"=>"ឯកឧត្តម គង់ ចាន់",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>28
            ],
            [
                "name"=>"ឯកឧត្តម សៅ វណ្ណសិរីវុទ្ធ",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>29
            ],
            [
                "name"=>"ឯកឧត្តម កៅ ផល",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>30
            ],
            [
                "name"=>"ឯកឧត្តម ឡោ រស្មី",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>31
            ],
            [
                "name"=>"លោកជំទាវ ចាន់ ផលលឿន",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>32
            ],
            [
                "name"=>"ឯកឧត្តម យ៉ើ អាស៊ីគីន",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>33
            ],
            [
                "name"=>"ឯកឧត្តម ឈុំ ឆុនលី",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>34
            ],
            [
                "name"=>"ឯកឧត្តម ចាន់ សារុទ្ធ",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>35
            ],
            [
                "name"=>"ឯកឧត្តម ហៃ រស្មី",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>36
            ],
            [
                "name"=>"ឯកឧត្តម ហុង ណារិត",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>37
            ],
            [
                "name"=>"ឯកឧត្តម ស្រី សុទ្ធា",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>38
            ],
            [
                "name"=>"ឯកឧត្តម សួន សេរី",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>39
            ],
            [
                "name"=>"លោកជំទាវ លី សាគីណា",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>40
            ],
            [
                "name"=>"ឯកឧត្តម អេង ជាសាន",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>41
            ],
            [
                "name"=>"ឯកឧត្តម ប៉ុល សុផា",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>42
            ],
            [
                "name"=>"ឯកឧត្តម ឃី កុសល",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>43
            ],
            [
                "name"=>"ឯកឧត្តម ប៉ក់ សម័យ សុនីតិ",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>44
            ],
            [
                "name"=>"ឯកឧត្តម សៀក ឡេង",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>45
            ],
            [
                "name"=>"ឯកឧត្តម ឃី វិបុលបុត្រា",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>46
            ],
            [
                "name"=>"ឯកឧត្តម ចាន់ សុវត្ថិភាព",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>47
            ],
            [
                "name"=>"ឯកឧត្តម ជា ឆេង",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>48
            ],
            [
                "name"=>"លោកជំទាវ អ៊ឹម វចនា",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>49
            ],
            [
                "name"=>"លោកជំទាវ ហ៊ូ សុពណ៌",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>50
            ],
            [
                "name"=>"ឯកឧត្តម ផេង គឹមស្រ៊ុន",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>51
            ],
            [
                "name"=>"ឯកឧត្តម ឡឹក សុធារ",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>52
            ],
            [
                "name"=>"ឯកឧត្តម ខាន់ សុធី",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>53
            ],
            [
                "name"=>"ឯកឧត្តម គី ច័ន្ទរំដួល",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>54
            ],
            [
                "name"=>"ឯកឧត្តម ប៉ែន ផល្លីកា",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>55
            ],
            [
                "name"=>"ឯកឧត្តម ទឹម បូរក្ស",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>56
            ],
            [
                "name"=>"ឯកឧត្តម ខាន់ សំបាន",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>57
            ],
            [
                "name"=>"ឯកឧត្តម ឃឹម ហ្វីណង់",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>58
            ],
            [
                "name"=>"ឯកឧត្តម សុខ វិសាល",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>59
            ],
            [
                "name"=>"ឯកឧត្តម វ៉ា ពិសី",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>60
            ],
            [
                "name"=>"ឯកឧត្តម ស្រី វុឌ្ឍី",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>61
            ],
            [
                "name"=>"លោកជំទាវ ងិន សូនាង",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>62
            ],
            [
                "name"=>"ឯកឧត្តម សាយ សុភភោគា",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>63
            ],
            [
                "name"=>"លោកជំទាវ វ៉ាន់ សែនពិសី",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"អនុរដ្ឋលេខាធិការ",
                "order"=>64
            ],
            [
                "name"=>"លោក ម៉ុង ឡេង",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"ប្រធានក្រុមការងារមន្ត្រីគ្រប់គ្រងហិរញ្ញវត្ថុ",
                "order"=>100
            ],
            [
                "name"=>"កញ្ញា ឡាង មណ្ឌល",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"ប្រធានក្រុមការងាររេជ្ជទេយ្យ",
                "order"=>101
            ],
            [
                "name"=>"លោក ស្រី សោភ័ណ",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"ប្រធានក្រុមការងារលទ្ធកម្ម",
                "order"=>102
            ],
            [
                "name"=>"លោកស្រី កែវ ផល្លី",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"ប្រធានក្រុមការងារប្រមូលចំណូល",
                "order"=>103
            ],
            [
                "name"=>"លោកស្រី សំ សុទ្ធារី",
                "organization"=>"ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
                "position"=>"ប្រធានក្រុមការងារភ្នាក់ងារបើកផ្តល់",
                "order"=>104
            ],
        ];
        \App\Models\Personel::factory()->createMany($personels);
    }
}
